{"pages":[{"title":"","text":"","link":"/404.html"},{"title":"About Minkyu Choi","text":"IntroMinkyu Choi is a Artificial Intelligence &amp; Machine Learning Engineer working in the various industries around 3 years as a consultant. He had worked in a commerical sectors for a couple of years and moved to government sectors. He has been exposed to diverse machine learning and deep learning projects, experienced in various big data engineering projects including Hadoop, Spark, Kafka, etc. Minkyu’s Expertises ML/AI Infrastructure Cloud Computing &amp; Architect (Amazon Web Service) Data Pipelining — Batch &amp; Streaming Machine Learning &amp; Deep Learning Github LinkedIn Email #contact-buttons { width: 100%; display: flex; } #contact-butons a.button { flex-grow: 1; } @media screen and (max-width: 720px) { #contact-buttons a.button { width: 100%; margin-right: 0; } } EducactionGeorgia Institute of TechnologyMS in Data Science Knowledge-Based Artificial Intelligence: Cognitive Systems Big Data for Healthcare Computational Data Analytics (Machine Learning) Machine Learning For Trading High-Dimensional Data Analysis Baruch College **BBA in Computer Information System Data Warehousing Database Management System Quantiative Decision Making Regression and Forecasting Modeling ProfessionalTechfield LLCSubject Matter Expert in Big Data and Data Science Managed +10 consultants in the big data and data science team, supporting the projects such as a cloud data pipeline solution and an automated application platform with a machine learning system Worked closely with one of the fortune 500 client in order to accomplish a goal of the datapipeline project for the entire batch and streaming processing and achieved a cost reductionand efficient processing time Endpoint ClinicalData Engineer Worked as a back-end database developer of IRT system – providing integrated solution of clinical trials (e.g., patient record, drug supply management and site management) in order to provide technical solution for large size of pharmaceutical clients Argus Information and Advisory ServicesData Analyst Developed strategies, best practices, and technical requirements to improve data manipulation and analysis by querying millions of rows of data across multiple databases, using MS SQL Server to identify and resolve data issues, and leveraged large sets of data to define benchmark models to enable client’s objectives to better manage data and drive insights SkillPrograming &amp; Scripting Language: Scala | Java | Python | R |Bash |Big Data Application: Hadoop | Spark | Kafka | Flume | Nifi | Sqoop | ELK |Database: MySql | Cassandra | Hbase | Elasticsearch | DynamoDB |","link":"/about/index.html"}],"posts":[{"title":"Simulation 02 - Random variable","text":"Random variable can be generated from a good random number generator. If real variables has moved the reality, we could design a future with a good random variables. Simulation 02 - Random variable Author: Minkyu ChoiLast updated: 07/19/2019 ReferencesLink-1","link":"/2019/07/19/random-variable/"},{"title":"Simulation 01 - Random Number","text":"A simulation is not real but it can represent the real. It’s because a simulation is an imitation of real situation - it can’t be exact but it can be approximate. Simulation 01 - Random Number Author: Minkyu ChoiLast updated: 07/19/2019 Greeting this is a test post for the future references. 12if x == 'test': print(\"hello world\") $$\\begin{aligned} E[\\bar{X}]=E[\\sum􏰒X_i/n] =E[X_i]=μ\\end{aligned}$$ *The equation of test script is * $y = x + 1$","link":"/2019/07/18/random-number/"},{"title":"first-post","text":"Test Hello world.","link":"/2019/11/06/first-post/"}],"tags":[{"name":"simulation","slug":"simulation","link":"/tags/simulation/"},{"name":"random","slug":"random","link":"/tags/random/"},{"name":"random variable","slug":"random-variable","link":"/tags/random-variable/"},{"name":"inverse transform method","slug":"inverse-transform-method","link":"/tags/inverse-transform-method/"},{"name":"cutpoint method","slug":"cutpoint-method","link":"/tags/cutpoint-method/"},{"name":"convolution method","slug":"convolution-method","link":"/tags/convolution-method/"},{"name":"acceptance rejection method","slug":"acceptance-rejection-method","link":"/tags/acceptance-rejection-method/"},{"name":"composition method","slug":"composition-method","link":"/tags/composition-method/"},{"name":"multivariate normal distribution","slug":"multivariate-normal-distribution","link":"/tags/multivariate-normal-distribution/"},{"name":"stochastic process","slug":"stochastic-process","link":"/tags/stochastic-process/"},{"name":"random number","slug":"random-number","link":"/tags/random-number/"}],"categories":[{"name":"Simulation","slug":"simulation","link":"/categories/simulation/"}]}